In [3]:
import pandas as pd
import numpy as np

df_dipendents = pd.read_csv("dipendenti.csv", sep = ';')
df_dipendents

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città
0,Marco,Rossi,NaN,2,Vendite,30000,Milano
1,Anna,Bianchi,32.0,7,Information Technology,45000,Roma
2,Luca,Verdi,28.0,5,Vendite,37000,Milano
3,Sara,Neri,40.0,12,Information Technology,62000,Roma
4,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino
5,Francesca,Ferrari,NaN,15,Human Resources,58000,Roma
6,Elena,Romano,34.0,8,Information Technology,52000,Milano
7,Simone,Gialli,30.0,4,Vendite,33000,Napoli
8,Valentina,Rossi,30.0,9,Vendite,32000,Napoli
9,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino
10,Anna,Bianchi,32.0,7,Vendite,45000,Milano
11,Sara,Bianchi,32.0,7,Vendite,25000,Roma
12,Sara,Romano,33.0,8,Information Technology,40000,Milano
13,Simone,Gialli,30.0,4,Vendite,33000,Napoli
14,Valentina,Rossi,30.0,12,Vendite,42000,Milano

In [12]:
print(df_dipendents.shape[1])

7

In [15]:
print(df_dipendents.shape[0])

15

In [ ]:
df_dipendents.duplicated().sum() #giorgio is duplicated

np.int64(2)

In [22]:
bins= [0, 5, 11, 100]
level_of_experiences = pd.cut(df_dipendents['Anni di esperienza'].values, bins, right=False, labels = ['junior', 'mid', 'senior'])
level_of_experiences

['junior', 'mid', 'mid', 'senior', 'senior', ..., 'mid', 'mid', 'mid', 'junior', 'senior']
Length: 15
Categories (3, object): ['junior' < 'mid' < 'senior']

In [20]:
def find_level(anni):
    if anni < 5:
        return 'Junior'
    elif anni <= 10:
        return 'Mid'
    else:
        return 'Senior'

df_dipendents['level_of_experiences'] = df_dipendents['Anni di esperienza'].map(find_level)

In [21]:
df_dipendents

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città,level_of_experiences
0,Marco,Rossi,NaN,2,Vendite,30000,Milano,Junior
1,Anna,Bianchi,32.0,7,Information Technology,45000,Roma,Mid
2,Luca,Verdi,28.0,5,Vendite,37000,Milano,Mid
3,Sara,Neri,40.0,12,Information Technology,62000,Roma,Senior
4,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino,Senior
5,Francesca,Ferrari,NaN,15,Human Resources,58000,Roma,Senior
6,Elena,Romano,34.0,8,Information Technology,52000,Milano,Mid
7,Simone,Gialli,30.0,4,Vendite,33000,Napoli,Junior
8,Valentina,Rossi,30.0,9,Vendite,32000,Napoli,Mid
9,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino,Senior
10,Anna,Bianchi,32.0,7,Vendite,45000,Milano,Mid
11,Sara,Bianchi,32.0,7,Vendite,25000,Roma,Mid
12,Sara,Romano,33.0,8,Information Technology,40000,Milano,Mid
13,Simone,Gialli,30.0,4,Vendite,33000,Napoli,Junior
14,Valentina,Rossi,30.0,12,Vendite,42000,Milano,Senior